n = int(input())
if n == 1:
    print('Время начала урока - 8:30, время конца - 9:15')
elif n == 2:
    print('Время начала урока - 9:25, время конца - 10:10')
elif n == 3:
    print('Время начала урока - 10:20, время конца - 11:05')
elif n == 4:
    print('Время начала урока - 11:15, время конца - 12:00')
elif n == 5:
    print('Время начала урока - 12:30, время конца - 13:15')
elif n == 6:
    print('Время начала урока - 13:25, время конца - 14:10')
else:
    print('Введите корректный номер урока')